       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. EADiooh.
      
       PROCEDURE DIVISION.
           DISPLAY 'Hello world!'.
           
           STOP RUN.
